


import SalesItem from "./SalesItem";

import image1 from "./img/image1.webp";
import image2 from "./img/image2.webp";
import image3 from "./img/image3.webp";
import image4 from "./img/image4.webp";
import image5 from "./img/image5.webp";
import image6 from "./img/image6.webp";
import image7 from "./img/image7.webp";
import image8 from "./img/image8.webp";
import image9 from "./img/image9.webp";
import image10 from "./img/image10.webp";
import image11 from "./img/image11.webp";
import image12 from "./img/image12.webp";
import image13 from "./img/image13.webp";
import image14 from "./img/image14.webp";
import image15 from "./img/image15.webp";
import image16 from "./img/image16.webp";
import image17 from "./img/image17.webp";
import image18 from "./img/image18.webp";

const data = [
    {
        "data" : {
            "title":"Метизные изделия",
            "sale":"до -15%",
            "imgSrc":image1 
        },
        "title":"Делаем скидки на все метизные изделия до 15%",
        "text": "Уважаемые клиенты, рады объявить вам о нашей специальной акции на лакокрасочные материалы! Теперь вы можете придать своему дому новое великолепное обличие по невероятно выгодным ценам. Это ваш шанс создать уют и красоту в вашем жилище без лишних затрат!",
        "promocode": "LAKOART20",
        "dataText": [
            {
                "text": "Широкий ассортимент качественных лаков и красок для любых поверхностей. Разнообразие цветов и оттенков, чтобы удовлетворить самые изысканные вкусы. Продукция от проверенных производителей, гарантирующих долговечность и качество.",
            },
            {
                "text": "Используйте промокод при оформлении заказа и получите дополнительную скидку 20% на все лакокрасочные материалы. Это время для обновления вашего дома по самым доступным ценам!",
            },
        ]
    },
    {
        "data" : {
            "title":"Метизные изделия",
            "sale":"до -15%",
            "imgSrc":image2
        },
        "title":"Делаем скидки на все метизные изделия до 15%",
        "text": "Уважаемые клиенты, рады объявить вам о нашей специальной акции на лакокрасочные материалы! Теперь вы можете придать своему дому новое великолепное обличие по невероятно выгодным ценам. Это ваш шанс создать уют и красоту в вашем жилище без лишних затрат!",
        "promocode": "LAKOART20",
        "dataText": [
            {
                "text": "Широкий ассортимент качественных лаков и красок для любых поверхностей. Разнообразие цветов и оттенков, чтобы удовлетворить самые изысканные вкусы. Продукция от проверенных производителей, гарантирующих долговечность и качество.",
            },
            {
                "text": "Используйте промокод при оформлении заказа и получите дополнительную скидку 20% на все лакокрасочные материалы. Это время для обновления вашего дома по самым доступным ценам!",
            },
        ]
    },
    {
        "data" : {
            "title":"Метизные изделия",
            "sale":"до -15%",
            "imgSrc":image3
        },
        "title":"Делаем скидки на все метизные изделия до 15%",
        "text": "Уважаемые клиенты, рады объявить вам о нашей специальной акции на лакокрасочные материалы! Теперь вы можете придать своему дому новое великолепное обличие по невероятно выгодным ценам. Это ваш шанс создать уют и красоту в вашем жилище без лишних затрат!",
        "promocode": "LAKOART20",
        "dataText": [
            {
                "text": "Широкий ассортимент качественных лаков и красок для любых поверхностей. Разнообразие цветов и оттенков, чтобы удовлетворить самые изысканные вкусы. Продукция от проверенных производителей, гарантирующих долговечность и качество.",
            },
            {
                "text": "Используйте промокод при оформлении заказа и получите дополнительную скидку 20% на все лакокрасочные материалы. Это время для обновления вашего дома по самым доступным ценам!",
            },
        ]
    },
    {
        "data" : {
            "title":"Метизные изделия",
            "sale":"до -15%",
            "imgSrc":image4 
        },
        "title":"Делаем скидки на все метизные изделия до 15%",
        "text": "Уважаемые клиенты, рады объявить вам о нашей специальной акции на лакокрасочные материалы! Теперь вы можете придать своему дому новое великолепное обличие по невероятно выгодным ценам. Это ваш шанс создать уют и красоту в вашем жилище без лишних затрат!",
        "promocode": "LAKOART20",
        "dataText": [
            {
                "text": "Широкий ассортимент качественных лаков и красок для любых поверхностей. Разнообразие цветов и оттенков, чтобы удовлетворить самые изысканные вкусы. Продукция от проверенных производителей, гарантирующих долговечность и качество.",
            },
            {
                "text": "Используйте промокод при оформлении заказа и получите дополнительную скидку 20% на все лакокрасочные материалы. Это время для обновления вашего дома по самым доступным ценам!",
            },
        ]
    },
    {
        "data" : {
            "title":"Метизные изделия",
            "sale":"до -15%",
            "imgSrc":image5 
        },
        "title":"Делаем скидки на все метизные изделия до 15%",
        "text": "Уважаемые клиенты, рады объявить вам о нашей специальной акции на лакокрасочные материалы! Теперь вы можете придать своему дому новое великолепное обличие по невероятно выгодным ценам. Это ваш шанс создать уют и красоту в вашем жилище без лишних затрат!",
        "promocode": "LAKOART20",
        "dataText": [
            {
                "text": "Широкий ассортимент качественных лаков и красок для любых поверхностей. Разнообразие цветов и оттенков, чтобы удовлетворить самые изысканные вкусы. Продукция от проверенных производителей, гарантирующих долговечность и качество.",
            },
            {
                "text": "Используйте промокод при оформлении заказа и получите дополнительную скидку 20% на все лакокрасочные материалы. Это время для обновления вашего дома по самым доступным ценам!",
            },
        ]
    },
    {
        "data" : {
            "title":"Метизные изделия",
            "sale":"до -15%",
            "imgSrc":image6 
        },
        "title":"Делаем скидки на все метизные изделия до 15%",
        "text": "Уважаемые клиенты, рады объявить вам о нашей специальной акции на лакокрасочные материалы! Теперь вы можете придать своему дому новое великолепное обличие по невероятно выгодным ценам. Это ваш шанс создать уют и красоту в вашем жилище без лишних затрат!",
        "promocode": "LAKOART20",
        "dataText": [
            {
                "text": "Широкий ассортимент качественных лаков и красок для любых поверхностей. Разнообразие цветов и оттенков, чтобы удовлетворить самые изысканные вкусы. Продукция от проверенных производителей, гарантирующих долговечность и качество.",
            },
            {
                "text": "Используйте промокод при оформлении заказа и получите дополнительную скидку 20% на все лакокрасочные материалы. Это время для обновления вашего дома по самым доступным ценам!",
            },
        ]
    },
    {
        "data" : {
            "title":"Метизные изделия",
            "sale":"до -15%",
            "imgSrc":image7
        },
        "title":"Делаем скидки на все метизные изделия до 15%",
        "text": "Уважаемые клиенты, рады объявить вам о нашей специальной акции на лакокрасочные материалы! Теперь вы можете придать своему дому новое великолепное обличие по невероятно выгодным ценам. Это ваш шанс создать уют и красоту в вашем жилище без лишних затрат!",
        "promocode": "LAKOART20",
        "dataText": [
            {
                "text": "Широкий ассортимент качественных лаков и красок для любых поверхностей. Разнообразие цветов и оттенков, чтобы удовлетворить самые изысканные вкусы. Продукция от проверенных производителей, гарантирующих долговечность и качество.",
            },
            {
                "text": "Используйте промокод при оформлении заказа и получите дополнительную скидку 20% на все лакокрасочные материалы. Это время для обновления вашего дома по самым доступным ценам!",
            },
        ]
    },
    {
        "data" : {
            "title":"Метизные изделия",
            "sale":"до -15%",
            "imgSrc":image8 
        },
        "title":"Делаем скидки на все метизные изделия до 15%",
        "text": "Уважаемые клиенты, рады объявить вам о нашей специальной акции на лакокрасочные материалы! Теперь вы можете придать своему дому новое великолепное обличие по невероятно выгодным ценам. Это ваш шанс создать уют и красоту в вашем жилище без лишних затрат!",
        "promocode": "LAKOART20",
        "dataText": [
            {
                "text": "Широкий ассортимент качественных лаков и красок для любых поверхностей. Разнообразие цветов и оттенков, чтобы удовлетворить самые изысканные вкусы. Продукция от проверенных производителей, гарантирующих долговечность и качество.",
            },
            {
                "text": "Используйте промокод при оформлении заказа и получите дополнительную скидку 20% на все лакокрасочные материалы. Это время для обновления вашего дома по самым доступным ценам!",
            },
        ]
    },
    {
        "data" : {
            "title":"Метизные изделия",
            "sale":"до -15%",
            "imgSrc":image9 
        },
        "title":"Делаем скидки на все метизные изделия до 15%",
        "text": "Уважаемые клиенты, рады объявить вам о нашей специальной акции на лакокрасочные материалы! Теперь вы можете придать своему дому новое великолепное обличие по невероятно выгодным ценам. Это ваш шанс создать уют и красоту в вашем жилище без лишних затрат!",
        "promocode": "LAKOART20",
        "dataText": [
            {
                "text": "Широкий ассортимент качественных лаков и красок для любых поверхностей. Разнообразие цветов и оттенков, чтобы удовлетворить самые изысканные вкусы. Продукция от проверенных производителей, гарантирующих долговечность и качество.",
            },
            {
                "text": "Используйте промокод при оформлении заказа и получите дополнительную скидку 20% на все лакокрасочные материалы. Это время для обновления вашего дома по самым доступным ценам!",
            },
        ]
    },
    {
        "data" : {
            "title":"Метизные изделия",
            "sale":"до -15%",
            "imgSrc":image10 
        },
        "title":"Делаем скидки на все метизные изделия до 15%",
        "text": "Уважаемые клиенты, рады объявить вам о нашей специальной акции на лакокрасочные материалы! Теперь вы можете придать своему дому новое великолепное обличие по невероятно выгодным ценам. Это ваш шанс создать уют и красоту в вашем жилище без лишних затрат!",
        "promocode": "LAKOART20",
        "dataText": [
            {
                "text": "Широкий ассортимент качественных лаков и красок для любых поверхностей. Разнообразие цветов и оттенков, чтобы удовлетворить самые изысканные вкусы. Продукция от проверенных производителей, гарантирующих долговечность и качество.",
            },
            {
                "text": "Используйте промокод при оформлении заказа и получите дополнительную скидку 20% на все лакокрасочные материалы. Это время для обновления вашего дома по самым доступным ценам!",
            },
        ]
    },
    {
        "data" : {
            "title":"Метизные изделия",
            "sale":"до -15%",
            "imgSrc":image11 
        },
        "title":"Делаем скидки на все метизные изделия до 15%",
        "text": "Уважаемые клиенты, рады объявить вам о нашей специальной акции на лакокрасочные материалы! Теперь вы можете придать своему дому новое великолепное обличие по невероятно выгодным ценам. Это ваш шанс создать уют и красоту в вашем жилище без лишних затрат!",
        "promocode": "LAKOART20",
        "dataText": [
            {
                "text": "Широкий ассортимент качественных лаков и красок для любых поверхностей. Разнообразие цветов и оттенков, чтобы удовлетворить самые изысканные вкусы. Продукция от проверенных производителей, гарантирующих долговечность и качество.",
            },
            {
                "text": "Используйте промокод при оформлении заказа и получите дополнительную скидку 20% на все лакокрасочные материалы. Это время для обновления вашего дома по самым доступным ценам!",
            },
        ]
    },
    {
        "data" : {
            "title":"Метизные изделия",
            "sale":"до -15%",
            "imgSrc":image12 
        },
        "title":"Делаем скидки на все метизные изделия до 15%",
        "text": "Уважаемые клиенты, рады объявить вам о нашей специальной акции на лакокрасочные материалы! Теперь вы можете придать своему дому новое великолепное обличие по невероятно выгодным ценам. Это ваш шанс создать уют и красоту в вашем жилище без лишних затрат!",
        "promocode": "LAKOART20",
        "dataText": [
            {
                "text": "Широкий ассортимент качественных лаков и красок для любых поверхностей. Разнообразие цветов и оттенков, чтобы удовлетворить самые изысканные вкусы. Продукция от проверенных производителей, гарантирующих долговечность и качество.",
            },
            {
                "text": "Используйте промокод при оформлении заказа и получите дополнительную скидку 20% на все лакокрасочные материалы. Это время для обновления вашего дома по самым доступным ценам!",
            },
        ]
    },
    {
        "data" : {
            "title":"Метизные изделия",
            "sale":"до -15%",
            "imgSrc":image13 
        },
        "title":"Делаем скидки на все метизные изделия до 15%",
        "text": "Уважаемые клиенты, рады объявить вам о нашей специальной акции на лакокрасочные материалы! Теперь вы можете придать своему дому новое великолепное обличие по невероятно выгодным ценам. Это ваш шанс создать уют и красоту в вашем жилище без лишних затрат!",
        "promocode": "LAKOART20",
        "dataText": [
            {
                "text": "Широкий ассортимент качественных лаков и красок для любых поверхностей. Разнообразие цветов и оттенков, чтобы удовлетворить самые изысканные вкусы. Продукция от проверенных производителей, гарантирующих долговечность и качество.",
            },
            {
                "text": "Используйте промокод при оформлении заказа и получите дополнительную скидку 20% на все лакокрасочные материалы. Это время для обновления вашего дома по самым доступным ценам!",
            },
        ]
    },
    {
        "data" : {
            "title":"Метизные изделия",
            "sale":"до -15%",
            "imgSrc":image14 
        },
        "title":"Делаем скидки на все метизные изделия до 15%",
        "text": "Уважаемые клиенты, рады объявить вам о нашей специальной акции на лакокрасочные материалы! Теперь вы можете придать своему дому новое великолепное обличие по невероятно выгодным ценам. Это ваш шанс создать уют и красоту в вашем жилище без лишних затрат!",
        "promocode": "LAKOART20",
        "dataText": [
            {
                "text": "Широкий ассортимент качественных лаков и красок для любых поверхностей. Разнообразие цветов и оттенков, чтобы удовлетворить самые изысканные вкусы. Продукция от проверенных производителей, гарантирующих долговечность и качество.",
            },
            {
                "text": "Используйте промокод при оформлении заказа и получите дополнительную скидку 20% на все лакокрасочные материалы. Это время для обновления вашего дома по самым доступным ценам!",
            },
        ]
    },
    {
        "data" : {
            "title":"Метизные изделия",
            "sale":"до -15%",
            "imgSrc":image15 
        },
        "title":"Делаем скидки на все метизные изделия до 15%",
        "text": "Уважаемые клиенты, рады объявить вам о нашей специальной акции на лакокрасочные материалы! Теперь вы можете придать своему дому новое великолепное обличие по невероятно выгодным ценам. Это ваш шанс создать уют и красоту в вашем жилище без лишних затрат!",
        "promocode": "LAKOART20",
        "dataText": [
            {
                "text": "Широкий ассортимент качественных лаков и красок для любых поверхностей. Разнообразие цветов и оттенков, чтобы удовлетворить самые изысканные вкусы. Продукция от проверенных производителей, гарантирующих долговечность и качество.",
            },
            {
                "text": "Используйте промокод при оформлении заказа и получите дополнительную скидку 20% на все лакокрасочные материалы. Это время для обновления вашего дома по самым доступным ценам!",
            },
        ]
    },
    {
        "data" : {
            "title":"Метизные изделия",
            "sale":"до -15%",
            "imgSrc":image16 
        },
        "title":"Делаем скидки на все метизные изделия до 15%",
        "text": "Уважаемые клиенты, рады объявить вам о нашей специальной акции на лакокрасочные материалы! Теперь вы можете придать своему дому новое великолепное обличие по невероятно выгодным ценам. Это ваш шанс создать уют и красоту в вашем жилище без лишних затрат!",
        "promocode": "LAKOART20",
        "dataText": [
            {
                "text": "Широкий ассортимент качественных лаков и красок для любых поверхностей. Разнообразие цветов и оттенков, чтобы удовлетворить самые изысканные вкусы. Продукция от проверенных производителей, гарантирующих долговечность и качество.",
            },
            {
                "text": "Используйте промокод при оформлении заказа и получите дополнительную скидку 20% на все лакокрасочные материалы. Это время для обновления вашего дома по самым доступным ценам!",
            },
        ]
    },
    {
        "data" : {
            "title":"Метизные изделия",
            "sale":"до -15%",
            "imgSrc":image17 
        },
        "title":"Делаем скидки на все метизные изделия до 15%",
        "text": "Уважаемые клиенты, рады объявить вам о нашей специальной акции на лакокрасочные материалы! Теперь вы можете придать своему дому новое великолепное обличие по невероятно выгодным ценам. Это ваш шанс создать уют и красоту в вашем жилище без лишних затрат!",
        "promocode": "LAKOART20",
        "dataText": [
            {
                "text": "Широкий ассортимент качественных лаков и красок для любых поверхностей. Разнообразие цветов и оттенков, чтобы удовлетворить самые изысканные вкусы. Продукция от проверенных производителей, гарантирующих долговечность и качество.",
            },
            {
                "text": "Используйте промокод при оформлении заказа и получите дополнительную скидку 20% на все лакокрасочные материалы. Это время для обновления вашего дома по самым доступным ценам!",
            },
        ]
    },
    {
        "data" : {
            "title":"Метизные изделия",
            "sale":"до -15%",
            "imgSrc":image18 
        },
        "title":"Делаем скидки на все метизные изделия до 15%",
        "text": "Уважаемые клиенты, рады объявить вам о нашей специальной акции на лакокрасочные материалы! Теперь вы можете придать своему дому новое великолепное обличие по невероятно выгодным ценам. Это ваш шанс создать уют и красоту в вашем жилище без лишних затрат!",
        "promocode": "LAKOART20",
        "dataText": [
            {
                "text": "Широкий ассортимент качественных лаков и красок для любых поверхностей. Разнообразие цветов и оттенков, чтобы удовлетворить самые изысканные вкусы. Продукция от проверенных производителей, гарантирующих долговечность и качество.",
            },
            {
                "text": "Используйте промокод при оформлении заказа и получите дополнительную скидку 20% на все лакокрасочные материалы. Это время для обновления вашего дома по самым доступным ценам!",
            },
        ]
    },
    {
        "data" : {
            "title":"Метизные изделия",
            "sale":"до -15%",
            "imgSrc":image17 
        },
        "title":"Делаем скидки на все метизные изделия до 15%",
        "text": "Уважаемые клиенты, рады объявить вам о нашей специальной акции на лакокрасочные материалы! Теперь вы можете придать своему дому новое великолепное обличие по невероятно выгодным ценам. Это ваш шанс создать уют и красоту в вашем жилище без лишних затрат!",
        "promocode": "LAKOART20",
        "dataText": [
            {
                "text": "Широкий ассортимент качественных лаков и красок для любых поверхностей. Разнообразие цветов и оттенков, чтобы удовлетворить самые изысканные вкусы. Продукция от проверенных производителей, гарантирующих долговечность и качество.",
            },
            {
                "text": "Используйте промокод при оформлении заказа и получите дополнительную скидку 20% на все лакокрасочные материалы. Это время для обновления вашего дома по самым доступным ценам!",
            },
        ]
    },
    {
        "data" : {
            "title":"Метизные изделия",
            "sale":"до -15%",
            "imgSrc":image18 
        },
        "title":"Делаем скидки на все метизные изделия до 15%",
        "text": "Уважаемые клиенты, рады объявить вам о нашей специальной акции на лакокрасочные материалы! Теперь вы можете придать своему дому новое великолепное обличие по невероятно выгодным ценам. Это ваш шанс создать уют и красоту в вашем жилище без лишних затрат!",
        "promocode": "LAKOART20",
        "dataText": [
            {
                "text": "Широкий ассортимент качественных лаков и красок для любых поверхностей. Разнообразие цветов и оттенков, чтобы удовлетворить самые изысканные вкусы. Продукция от проверенных производителей, гарантирующих долговечность и качество.",
            },
            {
                "text": "Используйте промокод при оформлении заказа и получите дополнительную скидку 20% на все лакокрасочные материалы. Это время для обновления вашего дома по самым доступным ценам!",
            },
        ]
    }
]




const SalesItems = () => {
    return (
        <div className="grid grid-cols-4 gap-5 mb-14">
            {
                data.map((item) => {
                    return (
                        <SalesItem {...item}/>
                    )
                })
            }
        </div>
    )
}

export default SalesItems